trade_exp/src/Catalogs/ШаблоныОцениванияСотрудников/ШаблоныОцениванияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4493fd5b-84a9-4145-9152-d183d059db72">
  <name>ШаблоныОцениванияСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <tabularSections extendedConfigurationObject="5d296acf-b965-48b4-8f42-e4e6692f301b">
    <name>Компетенции</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="49eeb065-bac3-4c12-bba1-dab76b9cf628">
      <name>Компетенция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/Documents/ОценкаСотрудника/ОценкаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="31dad2e1-52ed-47e0-8e0c-ea66f9c6cc99">
  <name>ОценкаСотрудника</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3e4e02bd-ccf9-4fe3-9537-b410d239a264">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="028eb805-5562-48f7-b7ba-e77df0517f7c">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a4403a3-3ccf-4461-9c91-4a6e6666ac26">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="512a2aa7-f75a-407b-b117-2843f292c050">
    <name>ШаблонОцениванияСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f0a47e44-59f5-4577-a40b-d97c6ae8d312">
    <name>ОценкиКомпетенций</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9ecc3cfe-d803-4a2f-91b8-5360b52e9673">
      <name>Компетенция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84b74966-e7ea-4876-8356-d25e65842de7">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/ШаблоныОцениванияСотрудников/ObjectModule.bsl
Перем ДанныеДоЗаписи;

&НаСервере
&Вместо("ПередЗаписью")
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения) 
	ДанныеДоЗаписи = Ссылка.Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция");
КонецПроцедуры

&НаСервере
&Вместо("ПриЗаписи")
Процедура ПриЗаписи(Отказ)
	Изменилось = Ложь;
	ДанныеПослеЗаписи = Компетенции.Выгрузить().ВыгрузитьКолонку("Компетенция");
	          
	Если ДанныеДоЗаписи.Количество() <> ДанныеПослеЗаписи.Количество() Тогда
		Изменилось = Истина;
	Иначе
		Для НомерСтроки = 0 По Компетенции.Количество() - 1 Цикл
			Если ДанныеДоЗаписи[НомерСтроки] <> ДанныеПослеЗаписи[НомерСтроки] Тогда
				Изменилось = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла
	КонецЕсли;
	Если Изменилось Тогда
		Сообщить("Изменился состав или порядок строк шаблона. Необходимо обновить документы.");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументы() Экспорт 
	Отбор = Новый Структура;
	Отбор.Вставить("ШаблонОцениванияСотрудника", Ссылка);
	Выборка = Документы.ОценкаСотрудника.Выбрать(,,Отбор,);
	Пока Выборка.Следующий() Цикл
		докОбъект = Выборка.ПолучитьОбъект();
		тзОценки = докОбъект.ОценкиКомпетенций.Выгрузить();
		сОценки = Новый Соответствие;
		Для Каждого Строка Из тзОценки Цикл
			сОценки.Вставить(Строка.Компетенция, Строка.Значение);
		КонецЦикла;
		докОбъект.ОценкиКомпетенций.Очистить();
		докОбъект.ОценкиКомпетенций.Загрузить(докОбъект.ШаблонОцениванияСотрудника.Компетенции.Выгрузить());
		Для Каждого Строка Из докОбъект.ОценкиКомпетенций Цикл
			Строка.Значение = сОценки.Получить(Строка.Компетенция);
		КонецЦикла;
		докОбъект.Записать();
	КонецЦикла;
КонецПроцедуры
